LiftTestCase/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);    // Initially at rest

boundaryField
{
    top
    {
        type            noSlip;
    }
    
    bottom
    {
        type            noSlip;
    }
    
    inlet
    {
        type            noSlip;
    }
    
    outlet
    {
        type            noSlip;
    }
    
    front
    {
        type            noSlip;
    }
    
    back
    {
        type            noSlip;
    }
}

// ************************************************************************* //
