LiftTestCase/Allrun
#!/bin/bash
# Allrun - Automated test case execution

cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

echo "========================================="
echo "LIFT Solver Minimal Test Case"
echo "========================================="

echo "1. Cleaning previous results..."
./Allclean 2>/dev/null

echo "2. Generating mesh..."
runApplication blockMesh

echo "3. Checking mesh quality..."
runApplication checkMesh

echo "4. Setting initial fields (metal film)..."
runApplication setFields

echo "5. Checking initial field statistics..."
echo "   Alpha1 statistics:"
postProcess -func 'volFieldValue(alpha1,volAverage)' -time 0 2>/dev/null
echo "   Temperature statistics:"  
postProcess -func 'volFieldValue(T,volAverage)' -time 0 2>/dev/null

echo "6. Running LIFT solver..."
echo "   Expected runtime: 1-5 minutes"
echo "   Monitoring key outputs:"
runApplication compInterFoam | tee solver.log

echo "7. Post-processing complete!"
echo ""
echo "Results:"
echo "  - Check solver.log for convergence"
echo "  - paraFoam to visualize fields"
echo "  - Key files: T, Te, Tl, alpha1, U"
echo ""
echo "Quick validation:"
echo "  Max temperature reached:"
grep "max:" solver.log | tail -5
echo ""
echo "  Phase change detected:"
postProcess -func 'volFieldValue(alpha1,volAverage)' -latestTime 2>/dev/null

echo "========================================="
echo "Test case complete!"
echo "========================================="
# ************************************************************************* #

