LiftTestCase/constant/laserProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      laserProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// MILLISECOND-SCALE LASER (Instantaneous energy deposition)

// Power settings - total energy deposited instantly
peakIntensity       1e12;           // Lower intensity, longer pulse
pulseWidth          100e-6;         // 100 microsecond "pulse" 
wavelength          800e-9;         // Ti:Sapphire wavelength
spotSize            5e-6;           // 5 μm spot - same as before
pulseEnergy         10e-9;          // 10 nJ total energy

// Geometry - same as before
focus               (25e-6 9e-6 5e-6);    
direction           (0 1 0);              

// Material interaction - same physics
absorptionCoeff     5e7;            
reflectivity        0.3;            
gaussianProfile     true;           
maxReflections      1;              

// TIMING FOR MILLISECOND SCALE
continuousLaser     false;          
laserStartTime      0;              // Start immediately
laserEndTime        100e-6;         // 100 microsecond pulse

// This gives stable, predictable energy deposition over 100 μs
// Much easier than femtosecond precision!

// ************************************************************************* //
