LiftTestCase/system/sampleDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat raw;

sets
(
    laserLine
    {
        type    uniform;
        axis    y;
        start   (25e-6 8e-6 5e-6);
        end     (25e-6 15e-6 5e-6);
        nPoints 50;
    }
    
    centerline
    {
        type    uniform;
        axis    y;
        start   (25e-6 0 5e-6);
        end     (25e-6 20e-6 5e-6);
        nPoints 100;
    }
);

fields  (T Te Tl U alpha.metal p_rgh);
